# 1. ჩვეულებრივი გაყოფა (/) - ყოველთვის აბრუნებს ათწილადს (float)
print(10 / 2)   # მაგალითი 1: შედეგი 5.0
print(7 / 2)    # მაგალითი 2: შედეგი 3.5
print(1 / 4)    # მაგალითი 3: შედეგი 0.25

# 2. მთელი გაყოფა (//) - აბრუნებს მხოლოდ მთელ ნაწილს, ნაშთს აიგნორირებს
print(10 // 3)  # მაგალითი 1: შედეგი 3 (ნაცვლად 3.33-ისა)
print(15 // 4)  # მაგალითი 2: შედეგი 3
print(7 // 2)   # მაგალითი 3: შედეგი 3

# 3. ნაშთიანი გაყოფა (%) - აბრუნებს მხოლოდ გაყოფის შედეგად დარჩენილ ნაშთს
print(10 % 3)   # მაგალითი 1: შედეგი 1 (10 = 3*3 + 1)
print(15 % 4)   # მაგალითი 2: შედეგი 3 (15 = 4*3 + 3)
print(8 % 2)    # მაგალითი 3: შედეგი 0 (რადგან 8 ლუწია და უნაშთოდ იყოფა)



# 'elif' არის 'else if'-ის შემოკლებული ვერსია.
# ის გამოიყენება მაშინ, როცა გვაქვს ორზე მეტი არჩევანი/პირობა.
# თუ პირველი 'if' მცდარია, პროგრამა ამოწმებს 'elif'-ს. 
# ის გვეხმარება, რომ კოდი არ იყოს გადატვირთული ბევრი დამოუკიდებელი if-ით.

score = 85

if score >= 90:
    print("Grade: A")
elif score >= 80: # ეს შემოწმდება მხოლოდ მაშინ, თუ პირველი if არ შესრულდა
    print("Grade: B")
elif score >= 70:
    print("Grade: C")
else:
    print("Grade: F")


year = int(input("შემოიტანეთ წელი: "))

if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
    print(f"{year} ნაკიანი წელიწადია.")
else:
    print(f"{year} არ არის ნაკიანი.")

