.1#print-პრინტ ფუნქცია გამოიყენება იმისთვის რომ დავბეჭდოთ სახვადასხვა ტიპის მონაცემები ეკრანზე მაგ(ცვლადი,სტრინგი,ფლოატი.და სხვა)
    #()-ბრჩხილებს ვიყენებტ იმისტვის რომ პრინტ ფუნქცია გამოვიდზახოტ ანუ მასშ ვწერტ ყველა მონაცემს
     #მაგალიტად
    #print("Hello World")  #სტრინგის დაბეჭდვა
.2
number=15
print(number)


.3
#დეკლარაცია-არის ცვლადის ფუნქციის ან ელემენტის გსმოცხადება და პითონში დეკლარაცია და ცვლადის სახელის მინიჯება ერტად ხდება


.4
number=10
print(number)

number=20
print(number)
#ამ კოდში ვხედავტ რო მოცემულია 2 ცვლადი და ისინი გატოლებულნი
#  არიან 10 თან და 20 ცთAნ ამის შემდეგ ჩვენ პრინტ პუნქციის
#  წყალობიტ დავბეჯდეტ  2 რივე ცვლადი 

